from datetime import datetime

# нарощення та дисконтування за складними відсотковими ставками
# 2.1 нарощення за складними відсотковими ставками
# приклад 10
def f13(P, n, i):
    S = P * pow(1 + i, n)
    I = S - P
    print(f"S = {S}")
    print(f"P = {P}")

#приклад 11
def f14(P, i, i1, i2, n1, n2):
    S = P * pow(1 + i + i1, n1) * pow(1 + i + i2, n2)
    print(f"S = {S}")

# приклад 12
def f15(P, i, years, days):
    K = 365
    n = ((years * K) + days) / K    
    S1 = P * pow((1 + i), int(n)) * (1 + (n - int(n)) * i)
    S2 = P * pow(1 + 0.25, n)
    print(f"Змішаний метод нарахування відсотків : S1 =  {S1}")
    print(f"Простий метод нарахування відсотків : S2 =  {S2}")

# номінальна ставка відсотка
# приклад 13
def f16(P, j, n):
    years = n / 3
    S1 = P * pow((1 + j / 4), years)
    S2 = P * pow(1 + j / 4, int(years)) * (1 + (years - int(years)) * j / 4)
    print(f"Загальний метод : S1 = {S1}")
    print(f"Змішаний метод : S2 = {S2}")


# ефективна відсоткова ставка
# приклад 14
def f17(j, n):
    res = pow(1 + j/4, n * 4)
    print(f"Множник нарощення становить : {res}")

# приклад 15
def f18(j):
    i1 = pow(1 + j/12, 12) - 1
    i2 = pow(1 + j/365, 365) - 1
    print(f"Ефективна річна ставка за умов щомісячної капіталізації : {i1}%")
    print(f"Ефективна річна ставка за умов щоденної капіталізації : {i2}%")

# приклад 16
def f19(j, m, n):
    res = m * (pow(1 + j / n, n/m) - 1)
    print(f'Номінальна ставка j{m} = {res} = {round(res * 100, 2)}%')

execution_queue = {
                    f13: [100000, 0.2, 3],
                    f14: [50000, 0.15, 0.03, 0.04, 2, 4],
                    f15: [300000, 0.25, 2, 155],
                    f16: [100000, 0.22, 31],
                    f17: [0.15, 3],
                    f18: [0.2],
                    f19: [0.25, 4, 12]
}

for i in execution_queue:
    i(*execution_queue[i])
    print("#" * 20)
